const dbtiConnection = {
  simpleDes: {
    CNEA: "똥꼬발랄 핵인싸형",
    CNEL: " 곱게 자란 막내둥이형",
    CNIA: "주위에 관심없는 나혼자 산다형",
    CNIL: "치고 빠지고 밀당천재형",
    CTEA: "까칠한 만능엔터테이너형",
    CTEL: "신이 내린 반려특화형",
    CTIA: "놀 줄 아는 모범생형",
    CTIL: "모범견계의 엄친아형",
    WNEA: "동네 대장 일진형",
    WNEL: "까칠한 지킬 앤 하이드형",
    WNIA: "선긋는 외톨이 야생견형",
    WNIL: "패닉에 빠진 극소심형",
    WTEA: "허세부리는 호기심쟁이",
    WTEL: "초면엔 신중 구면엔 친구",
    WTIA: "조심스러운 관찰형",
    WTIL: "엄마 껌딱지 겁쟁이형"
  },
  dbtiDes: {
    CNEA: `사랑은 핵인싸네요 다 혼냈어요?? 그럼 이제 신나게 놀아요~ 
            잘못한 행동을 했을 때 보호자가 벌을 주면 주눅은 들지만, 
            금방 풀릴 정도로 성격이 쾌활하고 사람보다 친구들과 노는 것을 더 좋아해요. 
            여기저기 다 간섭하고 다니는 오지랖퍼에요. 
            친구야 뭐라고? 아 몰랑~ 놀자~~ 싫다고? 알았어 
            다른 강아지와 노는 것을 너무 좋아해서 다른 강아지가 싫어해도 우선 자기 마음대로 들이대고 보는 성격이에요. 
            다른 강아지의 시그널을 잘 이해하는 편이라 상대 강아지가 싫다고 표현하면 거리를 지켜줘요. 
            내 이상형은 엄마 닮은 분들~~ 
            집에서 보호자와 단둘이 있을 때는 말을 잘 듣는 것 같지만
            새로운 환경이나 타인,타견을 만나면 보호자에게 관심이 없어요.
            보호자와 성향이 비슷한 사람들과는 빨리 친해지지만,
            성별이나 성향이 다르면 친해지는데 약간의 시간이 걸려요.
            텐션이 너무 높아 차분한 사람에게는 부담스러울 정도로 똥꼬발랄한 귀염둥이에요.`,
    CNEL: `사랑은 우리집 막둥이네요 
나 이쁘죠?? 그니까 간식 하나 주세요~~ 
넘치는 애교가 주무기~ 이를 활용해 보호자에게 요구성 행동을 많이 하는 경향이 있어요. 보호자님을 매우 좋아하고 집중력이 높아 훈련하기에도 수월해요. 다만, 보호자를 너무 좋아해서 분리불안이 생길 수도 있어요. 
친구야~ 천천히 니 스타일에 맞게 스며들어 줄게. 
친구들의 시그널을 이해하고 차분하게 다가가는 스타일이에요. 강아지 친구들과 적극적으로 인사하기 보다는 무심한 듯 서로 인사하고 다른 아이들과 잘 어울리고 트러블을 일으킬 확률이 낮아요. 
모르는 사람 따라가면 안 된댔어요. 
보호자에게 감정표현이 솔직한 편이에요, 때론 삐지거나 토라진 모습을 보일 수 있어요. 다른 사람들에게는 무관심하거나 신중해서 친해지는데 시간이 오래 걸릴 수 있어요. 너무 적극적인 사람은 부담스러워 하고 일반 사람들에게 무조건적인 호의를 보이지는 않고 적당한 거리를 두고 관찰해요. `,
    CNIA: `쏘야는 새로운 환경에서 혼자 노는걸 좋아해요. 
혼자 떠나는 여행이 최고에요~ 
환경적응력이 높아 낯선 환경에서도 두려움 없이 잘 돌아다니며, 새로운 환경에 대한 호기심도 많은 편이에요. 독립적인 성향이 있어 혼자노는 것을 좋아해요. 
친구야 조금은 참겠지만 선 넘으면 같이 죽는거야… 
친하거나 성향이 잘 맞는 친구와 놀기는 하지만, 독립적인 성향이 있어 혼자 노는 것을 더 좋아해요. 친구가 지나치게 무례하게 구는 경우가 아니라면 크게 신경 쓰지 않지만. 상대방이 선을 넘는 행동을 하면 물러서지 않고 대응해요. 
나는 차가운 도시 멍멍이 하지만 필요한 게 있으면 꼬리를 사정없이 흔들겠지 
엄마가 간식이나 장난감을 들고 있는 것을 확인하면 천재견이 따로 없어요. 자기 주장이 강하고 독립적인 성향이 있어 사람에게 무관심한 편이에요. 하지만 자기가 아쉬운 부분이 생기면 매우 애교를 부려요. 강아지와 노는 것보다 사람과 노는 것을 더 좋아해요. `,

    CNIL: `사랑은 고양이처럼 밀당을 잘하고 혼자서도 잘 지내요. 
필요한게 있으면 밀당하듯이 원하는 바를 얻어내는 스타일 
어떻게 하면 보호자에게 자기가 원하는 것을 얻을 수 있는지 너무나도 잘 알고 있어요. 
친구야 저리가… 이게 갖고 싶어? 그래 가지고 저리 가 
친하거나 성향이 잘 맞는 친구와 놀기는 하지만, 독립적인 성향이 있어 혼자 노는 것을 더 좋아해요. 다른 강아지와 문제가 생기면 안전한 장소로 회피하고 자기 것을 빼앗겨도 포기해요. 그래도 상대방이 너무 적극적이어서 궁지에 몰리면 무는 등 소심하게 반격할 수 있어요. 
나는 여우같은 강아지 
보호자를 생존도구로만 생각하고 필요할 때만 찾거나 애교를 부려요. 기본적으로 사람에게 무관심한 편이지만 간식이 있으면 처음 보는 사람도 바로 따르는 모습을 보여요. `,
    CTEA: `사랑은 인간 사회 적응 만렙이에요 
사람을 신뢰하고 개도 좋아하는 똥꼬발랄이 
사회성이 매우 뛰어난 반려견으로 사람과 강아지 모두에게 사랑 받는 성격입니다 언제 어디서나 환경에 대한 두려움이 없고 낯선 대상에 대해서도 친근하게 다가가는 편이며, 활동적인 만능 엔터테이너 
친구들 왜들 그리 다운되어 있어~ 내가 왔다 놀자! 
언제 어디서든 긍정적인 에너지가 넘쳐 다른 강아지에게 활력을 불어 넣어주는 분위기 메이커에요. 다른 강아지에게 좋아하는 감정을 적극적으로 먼저 표현하는 스타일이에요. 다른 강아지의 시그널을 잘 이해하는 편이라 상대 강아지가 싫다고 표현하면 거리를 지켜주는 편이에요. 
사람은 다 좋아~~ 놀자~ 놀아줘요~ 
보호자에 대한 무조건적인 신뢰가 형성되어 있어요. 사람들을 구별하지 않고, 무조건적으로 다 좋아하는 사랑이 넘치는 친구에요. 텐션이 너무 높아 차분한 사람이나 강아지는 부담스럽게 느낄 수도 있어요. `,
    CTEL: `사랑은 강아지 계의 유재석이네요. 
사람을 신뢰하고 개도 좋아하는 얌전이 
사회성이 매우 뛰어난 반려견으로 사람과 강아지 모두에게 사랑받는 성격입니다. 언제 어디서나 환경에 대한 두려움이 없고, 낯선 대상에게도 친근하게 다가가는 편이며, 사람과 강아지에 대해 공감능력이 뛰어나 매개치료견이나 헬퍼독으로 짱! 
드루와. 오히려 좋아~ 
모든 상황에 대해 긍정적으로 받아들이고, 다른 강아지에게 안정감을 줍니다. 상대가 어떠한 행동을 하더라도 다 맞춰줄 수 있는 스펀지 같은 친구. 
난 오빠 믿어. 오빤 나 믿지? 
언제 어디서 불러도 잘 오고 보호자를 리더로 생각하며 신뢰해요. 낯선 사람이 자기에게 스트레스를 줘도 문제행동이나 요구성 행동을 잘 보이지 않아요. `,
    CTIA: `콩콩이가는 보호자가 노력하기 나름이에요. 
보호자님과 함께 놀이를 하며 교감하고 싶어해요.
보호자님과 매우 높은 교감능력이 있어 보호자와 함께 여행을 다니면 좋아할 거에요. (활발하고 에너지가 넘치는 아이들은 스포츠 독으로 키워도 되겠네요.) 
나는 엄마아빠랑 노는게 제일 좋아~
다른 반려견과 노는 것 보다 보호자와 교감하며 함께 있는 것을 더 좋아해요. 
엄마는 좋아요. 다른 분들은 뭐 그냥 soso
보호자에게 새로운 것을 학습하는 것을 좋아하고 대체적으로 잘 따르는 편이에요. 다른 사람은 너무 좋아하지도, 싫어하지도 않아요. `,
    CTIL: `트러블이 거의 없는 모범견이네요.
엄친아의 보호자라니 축하드립니다. 보호자와 교감능력이 매우 뛰어나고, 다른 강아지들과 트러블을 일으킬 가능성이 가장 낮은 모범견 친구에요. 반려견 훈련소에 상주하는 헬퍼독 수준으로 바르게 자랐네요. 
차분한 성격에 친구를 배려하여 다른 강아지와 관계가 좋아요.
다른 친구들의 다양한 행동에도 크게 동요하지 않고 묵묵히 바라보는 여유를 가지고 있어요. 다른 강아지가 너무 적극적으로 표현해도 부드럽게 회피하기에 싸움을 일으킬 가능성이 매우 낮은 친구 입니다. 
당신이 날 믿어주는 만큼 나도 당신을 믿을게요
보호자와 함께하는 모든 것을 좋아하고 믿고 따라요. 사람이 자기에게 스트레스를 줘도 문제행동이나 요구성 행동을 잘 보이지 않아요. `,
    WNEA: `사랑은 동네 대장 스타일이에요 
내가 이 구역의 대장이야! 
이 동네도 이 물건도 저 물건도 내거! 다 내거야~ 산책 시 마킹이나 노즈워킹  등 본능적인 욕구를 충족하기 위해 보호자를 끊임없이 당기며 걸어다녀요. 소유욕이 높아 자신의 것을 지키려고 하는 행동이 강하고, 지키고 있는 것을 뺏으려고 할 때 주의가 매우 필요해요. 
이 동네 대장이 너냐? 덤벼라! 
무리에서 항상 주도적인 역할을 하려고 해요. 자기 주장이 강해 다른 강아지를 누르기 위해 예의 없는 행동을 하기도 하고, 상대방이 지배성을 보이면 싸움을 일으킬 수 있어요. 
엄마! 내가 시키는대로 하라니까~ 
자신이 보호자의 행동을 제한하려고 하고, 스스로 규칙을 만들어 그대로 행동하도록 하는 스타일이에요. 자신의 영역에 들어온 타인에 대해서 공격성이 강하게 나타날 수 있어요. `,
    WNEL: `사랑은 까칠한 예민보스, 방구석제왕 이군요. 
나는 단골집 위주로 다니는 편이지 
낯선장소에서 다소 긴장감이 높고 예민한 모습을 보이며 적응하기 까지 꽤 오랜 시간이 걸릴 수 있지만 익숙한 곳에서는 다소 편안한 모습으로 다니며 때론 자신감 있는 행동도 보여줘요. 
나보다 약한 애가 덤비는 건 못 참아 
보호자가 있으면 활발하고 주도적인 성향을 많이 보이지만, 낯선 장소에서 보호자가 없으면 다소 소극적으로 변해요. 보호자가 사라지면 분리불안의 모습을 보이며 그 어떤 활동도 하지 않으려 해요익숙한 장소에서는 자신감이 넘쳐서 다른 강아지를 만나면 공격성을 보일 수 있어요. 자신보다 작은 강아지에게는 주도적인 모습을 보이고, 큰 강아지에게는 약한 모습을 보일 수 있는 강약약강 스타일이에요. 
보호자가 있으면 자신감 뿜뿜~ 없으면 소심~ 
보호자가 있으면 활발하고 주도적인 성향을 많이 보이지만, 낯선 장소에서 보호자가 없으면 다소 소극적으로 변해요. 보호자가 사라지면 분리불안의 모습을 보이며 그 어떤 활동도 하지 않으려 해요. 기본적으로 낯선 사람을 약간 경계하며 손님이 뒷모습을 보이면 갑자기 공격할 수도 있어요. `,
    WNIA: `사랑은 보호자를 비즈니스 관계로 대하는 아이입니다 
어디 계산기를 두드려 볼까? 
꽤나 독립적이라 평소에는 주로 혼자 있지만, 간식이나 산책 등 보호자가 필요하면 와서 애교를 떨거나 요구성 행동을 보입니다.
어쩌면 보호자가 보기에 도도해 보이거나 잔머리가 뛰어난 아이라고 판단할 수도 있어요. 환경에 대한 호기심과 적응능력이 좋은 편이며, 마당에 풀어 놓고 키우는 아이들에게 잘 나오는 성향입니다. 
친구야 조심스럽게 다가갈게~ 
처음 만난 다른 강아지에게 신중하게 다가가 탐색하는 편이에요. 자신에게 다가오는 친구는 회피하거나 두려운 감정을 가질 수 있어서 자신이 마음에 드는 친구를 선택해서 친해지는 편 이에요. 
간식도 안 주고 오라가라 하시면 곤란하죠~ 
보호자에게 요구적인 행동을 보일 수 있어요. 간식이나 혹은 장난감이 있으면 말을 잘 따르지만 없으면 무시하는 스타일이에요. 낯선 사람은 무시하지만 다가오면 경계 할 수 있어요.  `,
    WNIL: `사랑은 금방이라도 깨질 것만 같은 유리멘탈을 가진 아이입니다 
세상엔 무서운 것 투성이인데… 기댈 곳 하나 없네요. 
지금 자리를 잡은 작은 영역 외의 모든 상황에서 극도의 불안감을 보일 수 있습니다. 사람과 환경에 대해 높은 불신을 가지고 있으며, 어쩌면 보호자에게 조차도 불안해 할 수 있어요. 대체로 주변의 모든 자극에 예민하며 회피하려고 해요. 다양한 환경에 적응하기까지 시간이 꽤 오래 걸릴 수 있고 물러날 곳이 없는 상황에서 위협을 받으면 패닉에 빠질 수 있습니다. 
너 오지마! 나도 안 갈거야! 
대체적으로 다른 강아지들을 회피하는 스타일 입니다. 자신에게 다가오는 친구에게 극도의 두려움을 느낄 수 있습니다. 
누구세요? 무서워요~ ㅜ 
보호자(가족)에 대한 개념이 아직 없는 상태에요. 보호자조차 에게도 마음을 여는데는 시간과 노력이 다소 필요해요. 낯선 사람과 친해지는데 오래 걸릴 수 있어요. 낯선사람이 다가오면 공포를 느끼며 패닉에 빠질 수 있으며, 이 때 아무리 맛있는 간식을 줘도 먹지 않아요. `,
    WTEA: `사랑은 호기심 많은 탐험가 스타일의 아이입니다. 
          어디든 누구든 나는 무섭지 않아 
          어느 곳이든 두려움 없이 자신감 있게 환경을 파악하며 사람과 강아지에게 스스럼 없이 다가갈 수 있으나, 자신감이 높은 친구를 만나면 회피하려고 해요. 
          까불지마~ 나 태권도 검은 띠야 
          다른 반려견에게 자신의 힘을 과시하려고 해요. 온리쉬일 때나 자기 영역에서는 달려들거나 짖을 수 있어요. 그리고 흥분된 상태에서 다른 강아지를 공격할 수 있으니 주의해 주세요. 자기보다 덩치가 큰 아이한테 허세를 떠는 경우도 있습니다. 
          엄마! 내가 시키는대로 하라니까~ 
          보호자가 약한 모습을 보이면, 보호자의 행동을 제한하려고 하고 자신이 싫어 하는 행동을 하면 보호자도 물 수 있어요. 물고 나서는 눈치를 보거나 어쩔 줄 몰라하기도 해요. 자기만의 호감, 비호감의 기준을 만들고 비호감의 상대에겐 다소 거칠고 방어적인 모습을 보일 수 있어요. 낯선 사람에게 스스럼없이 다가갈 수 있으나, 자신에게 위협이 된다고 판단되면 가까이 가지않아요. `,
    WTEL: `사랑은 좋아하는 사람, 친구에게만 개구쟁이에요 
          엄마 나혼자 두고 갈꺼야..? 엄마가 필요해~~ 
          소심한 것 처럼 보일 수 있지만, 보호자를 신뢰하므로 자기 주장보다는 보호자의 뜻에 순응하는 편입니다. 대체로 사람을 좋아하지만, 자신의 영역에 낯선 사람이나 강아지가 오면 처음에 잠깐 주시하거나 경계할 수 있지만 금방 적응하고 친해질 수 있어요. 
          둘이 있을 땐 천사 
          산책을 하면서 다른 강아지 친구를 만나면 경계하거나 신중한 태도를 보여요. 낯선 사람이나 강아지가 다가오면 정자세로 있다가 멀어지면 다시 자신감 있는 척 행동해요. 
          엄마 나 두고 어디 가면 안돼~ ㅠ 
          보호자에게 애정을 듬뿍 받아 보호자에게 높은 의존도를 보여요. 보호자가 없으면 불안해 하는 전형적인 분리불안의 모습을 보이는 경우가 많아요. 낯선 사람은 갑자기 다가가기 보다는 강아지가 먼저 냄새를 맡고 파악할 수 있도록 시간과 기회를 주세요. `,
    WTIA: `사랑은 돌다리도 두들겨보고 건너는 신중한 아이입니다. 
          적응 전엔 철통방어! 적응하면 괜찮아. 
          성격은 소심하지만, 낯선 환경이나 대상으로부터 최대한 자신의 안전을 확인하기 위해 비교적 빠르게 파악하고 적응하는 편이에요. 파악이 완료된 후에는 제법 활동적인 모습을 보입니다. 오프리쉬일 때는 보호자라는 든든한 빽이 사라져서 낯선 상대와 트러블을 일으키길 원하지 않는 평화주의자가 됩니다. 
          매너 있게 다가 와줄래? 
          처음 만난 다른 강아지 친구에게는 신중하게 다가가며 상대를 자극하지 않으려 조심스럽게 행동하는 편이에요.하지만 자신에게 적극적으로 다가오는 친구는 회피하거나 다소 경계할 수 있어요. 때문에 다른 강아지 친구들과 두루두루 지내기 보다는 마음에 드는 친구를 직접 선택해서 친해지길 원하는 편이에요. 
          안전제일! 해치지만 않으면 낯선 사람도 OK 
          평소엔 보호자를 좋아하며 아무 문제 없이 잘 지내지만 먹이나 장난감처럼 필요한 것이 있을 때 보호자의 눈치를 살피며 소심한 모습을 보이는 경향이 있어요. 주로 보호자 곁을 맴도는 편이지만 낯선 사람도 위험하지 않다 판단되면 곧 친해질 수 있어요. `,
    WTIL: `사랑은 자신을 지키기 위해 매우 방어적인 아이입니다. 
          나는 자신감이 없어요 
          유약한 성격이라 환경적응이 어려울 수 있는 소심한 성향을 가지고 있으며, 자신의 생존을 최우선으로 생각하며 살고 있어요. 그리고 보호자에게 의존적인 성향을 많이 보여요. 일반적인 반려견보다 사회화가 부족했을 가능성이 커요. 유기되었거나 공장형 번식장처럼 열악한 환경 때문일 수도 모견의 양육태도나 강아지의 선천적 기질 때문일 수도 있어요. 
          너 누구야? 오지마! 엄마 도와줘~ 
          대체적으로 다른 강아지들을 회피하는 스타일 입니다. 적극적으로 다가오는 친구는 회피하거나 두려움에 경계할 수 있으며, 자기 자신을 지키는 것을 중요시 하는 친구 입니다. 
          엄마빼곤 다 무서워 
          겁쟁이지만 보호자와의 신뢰관계는 높아서 보호자 옆에서는 어느 정도 진정해요. 낯선 사람이 다가오면 두려워 하며 소극적으로 행동해요. 이때 아무리 맛있는 간식을 줘도 먹지 않아요. `,
  }
}

export default dbtiConnection;